redis_test_for_auto_numa_problem/redis_test_result_L_OFF_120G_2nd/memtier_benchmark_L_OFF_120G_2nd_Sequential82_P9_20230625035816.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        27021.62          ---          ---        26.33717        22.65500        55.29500        60.15900     57605.66 
Gets       108085.77    108085.77         0.00        23.01857        22.27100        43.77500        56.31900    229893.37 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     135107.39    108085.77         0.00        23.68229        22.27100        49.40700        58.36700    287499.03 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.215        0.000
SET      18.431        5.000
SET      19.583       10.000
SET      20.479       15.000
SET      20.991       20.000
SET      21.375       25.000
SET      21.631       30.000
SET      21.887       35.000
SET      22.143       40.000
SET      22.271       45.000
SET      22.655       50.000
SET      22.783       52.500
SET      23.039       55.000
SET      23.295       57.500
SET      23.679       60.000
SET      24.191       62.500
SET      24.575       65.000
SET      25.087       67.500
SET      25.599       70.000
SET      26.111       72.500
SET      26.879       75.000
SET      27.263       76.250
SET      27.647       77.500
SET      27.903       78.750
SET      28.543       80.000
SET      29.055       81.250
SET      29.823       82.500
SET      35.071       83.750
SET      38.143       85.000
SET      40.447       86.250
SET      41.983       87.500
SET      42.239       88.125
SET      42.751       88.750
SET      43.007       89.375
SET      43.263       90.000
SET      43.519       90.625
SET      43.775       91.250
SET      44.031       91.875
SET      44.543       92.500
SET      44.799       93.125
SET      45.311       93.750
SET      45.567       94.062
SET      45.823       94.375
SET      46.079       94.688
SET      46.591       95.000
SET      46.847       95.312
SET      47.615       95.625
SET      48.127       95.938
SET      48.895       96.250
SET      49.407       96.562
SET      49.919       96.875
SET      50.175       97.031
SET      50.431       97.188
SET      50.943       97.344
SET      51.199       97.500
SET      51.455       97.656
SET      51.967       97.812
SET      52.223       97.969
SET      52.735       98.125
SET      53.247       98.281
SET      53.759       98.438
SET      54.015       98.516
SET      54.271       98.594
SET      54.527       98.672
SET      54.783       98.750
SET      54.783       98.828
SET      55.039       98.906
SET      55.295       98.984
SET      55.551       99.062
SET      55.807       99.141
SET      56.063       99.219
SET      56.319       99.258
SET      56.575       99.297
SET      56.831       99.336
SET      56.831       99.375
SET      57.087       99.414
SET      57.343       99.453
SET      57.343       99.492
SET      57.599       99.531
SET      57.599       99.570
SET      57.855       99.609
SET      57.855       99.629
SET      58.111       99.648
SET      58.111       99.668
SET      58.111       99.688
SET      58.367       99.707
SET      58.367       99.727
SET      58.623       99.746
SET      58.623       99.766
SET      58.879       99.785
SET      59.135       99.805
SET      59.135       99.814
SET      59.135       99.824
SET      59.391       99.834
SET      59.391       99.844
SET      59.647       99.854
SET      59.647       99.863
SET      59.903       99.873
SET      59.903       99.883
SET      60.159       99.893
SET      60.159       99.902
SET      60.415       99.907
SET      60.415       99.912
SET      60.415       99.917
SET      60.671       99.922
SET      60.671       99.927
SET      60.671       99.932
SET      60.927       99.937
SET      61.183       99.941
SET      61.183       99.946
SET      61.439       99.951
SET      61.439       99.954
SET      61.695       99.956
SET      61.695       99.958
SET      61.951       99.961
SET      62.207       99.963
SET      63.999       99.966
SET      70.143       99.968
SET     216.063       99.971
SET     230.399       99.973
SET     231.423       99.976
SET     232.447       99.977
SET     232.447       99.978
SET     234.495       99.979
SET     234.495       99.980
SET     235.519       99.982
SET     236.543       99.983
SET     237.567       99.984
SET     238.591       99.985
SET     240.639       99.987
SET     252.927       99.988
SET     253.951       99.988
SET     254.975       99.989
SET     257.023       99.990
SET     259.071       99.990
SET     264.191       99.991
SET     270.335       99.991
SET     272.383       99.992
SET     276.479       99.993
SET     278.527       99.993
SET     278.527       99.994
SET     278.527       99.994
SET     278.527       99.995
SET     278.527       99.995
SET     278.527       99.995
[...]
SET     278.527       99.996
SET     278.527       99.996
SET     280.575       99.996
SET     280.575       99.997
SET     280.575       99.997
SET     280.575       99.997
[...]
SET     282.623       99.997
SET     282.623       99.998
SET     294.911       99.998
SET     296.959       99.998
SET     296.959       99.998
SET     299.007       99.998
SET     299.007       99.998
SET     303.103       99.998
SET     303.103       99.999
SET     305.151       99.999
SET     305.151       99.999
SET     305.151       99.999
[...]
SET     309.247       99.999
SET     309.247       99.999
SET     309.247       99.999
[...]
SET     311.295       99.999
SET     311.295       99.999
SET     311.295       99.999
[...]
SET     311.295      100.000
SET     311.295      100.000
SET     311.295      100.000
SET     325.631      100.000
SET     325.631      100.000
---
GET       1.215        0.000
GET      18.175        5.000
GET      19.199       10.000
GET      20.095       15.000
GET      20.735       20.000
GET      21.119       25.000
GET      21.375       30.000
GET      21.631       35.000
GET      21.759       40.000
GET      22.015       45.000
GET      22.271       50.000
GET      22.271       52.500
GET      22.399       55.000
GET      22.527       57.500
GET      22.655       60.000
GET      22.911       62.500
GET      23.039       65.000
GET      23.295       67.500
GET      23.551       70.000
GET      23.935       72.500
GET      24.447       75.000
GET      24.575       76.250
GET      24.703       77.500
GET      24.959       78.750
GET      25.087       80.000
GET      25.343       81.250
GET      25.599       82.500
GET      25.727       83.750
GET      25.983       85.000
GET      26.239       86.250
GET      26.623       87.500
GET      26.751       88.125
GET      26.879       88.750
GET      27.135       89.375
GET      27.263       90.000
GET      27.391       90.625
GET      27.519       91.250
GET      27.775       91.875
GET      27.903       92.500
GET      28.031       93.125
GET      28.287       93.750
GET      28.415       94.062
GET      28.543       94.375
GET      28.671       94.688
GET      28.671       95.000
GET      28.799       95.312
GET      28.927       95.625
GET      29.055       95.938
GET      29.183       96.250
GET      29.311       96.562
GET      29.567       96.875
GET      29.567       97.031
GET      29.695       97.188
GET      29.823       97.344
GET      29.951       97.500
GET      30.207       97.656
GET      30.463       97.812
GET      30.719       97.969
GET      31.615       98.125
GET      37.375       98.281
GET      40.191       98.438
GET      41.215       98.516
GET      41.727       98.594
GET      42.239       98.672
GET      42.751       98.750
GET      43.007       98.828
GET      43.263       98.906
GET      43.775       98.984
GET      44.031       99.062
GET      44.287       99.141
GET      44.799       99.219
GET      45.055       99.258
GET      45.311       99.297
GET      45.567       99.336
GET      45.823       99.375
GET      46.079       99.414
GET      46.591       99.453
GET      47.103       99.492
GET      47.615       99.531
GET      48.639       99.570
GET      49.151       99.609
GET      49.407       99.629
GET      49.919       99.648
GET      50.175       99.668
GET      50.431       99.688
GET      50.943       99.707
GET      51.455       99.727
GET      51.711       99.746
GET      52.223       99.766
GET      52.735       99.785
GET      53.503       99.805
GET      53.759       99.814
GET      54.015       99.824
GET      54.271       99.834
GET      54.527       99.844
GET      54.783       99.854
GET      55.039       99.863
GET      55.295       99.873
GET      55.807       99.883
GET      56.063       99.893
GET      56.575       99.902
GET      56.831       99.907
GET      57.087       99.912
GET      57.087       99.917
GET      57.343       99.922
GET      57.599       99.927
GET      57.855       99.932
GET      57.855       99.937
GET      58.111       99.941
GET      58.367       99.946
GET      58.623       99.951
GET      58.879       99.954
GET      59.135       99.956
GET      59.135       99.958
GET      59.391       99.961
GET      59.647       99.963
GET      60.159       99.966
GET      60.415       99.968
GET      60.927       99.971
GET      61.695       99.973
GET     217.087       99.976
GET     218.111       99.977
GET     230.399       99.978
GET     230.399       99.979
GET     231.423       99.980
GET     231.423       99.982
GET     232.447       99.983
GET     233.471       99.984
GET     234.495       99.985
GET     234.495       99.987
GET     235.519       99.988
GET     235.519       99.988
GET     235.519       99.989
GET     236.543       99.990
GET     236.543       99.990
GET     237.567       99.991
GET     238.591       99.991
GET     238.591       99.992
GET     239.615       99.993
GET     240.639       99.993
GET     240.639       99.994
GET     240.639       99.994
GET     257.023       99.995
GET     276.479       99.995
GET     276.479       99.995
GET     278.527       99.995
GET     278.527       99.996
GET     278.527       99.996
GET     278.527       99.996
GET     278.527       99.997
GET     278.527       99.997
GET     278.527       99.997
[...]
GET     278.527       99.998
GET     278.527       99.998
GET     278.527       99.998
[...]
GET     278.527       99.999
GET     278.527       99.999
GET     278.527       99.999
[...]
GET     280.575       99.999
GET     280.575       99.999
GET     280.575       99.999
[...]
GET     280.575      100.000
GET     280.575      100.000
GET     280.575      100.000
[...]
GET     282.623      100.000
GET     282.623      100.000
GET     282.623      100.000
[...]
GET     294.911      100.000
GET     299.007      100.000
GET     299.007      100.000
GET     303.103      100.000
GET     303.103      100.000
GET     303.103      100.000
GET     305.151      100.000
GET     305.151      100.000
GET     305.151      100.000
[...]
GET     307.199      100.000
GET     307.199      100.000
GET     307.199      100.000
GET     309.247      100.000
GET     309.247      100.000
GET     309.247      100.000
GET     311.295      100.000
GET     325.631      100.000
GET     325.631      100.000
---
WAIT      0.000      100.000